In [1]:
import pandas as pd

In [2]:
dataset  = pd.read_csv("./Social_Network_Ads.csv")

In [3]:
dataset.head()

    User ID  Gender  Age  EstimatedSalary  Purchased
0  15624510    Male   19            19000          0
1  15810944    Male   35            20000          0
2  15668575  Female   26            43000          0
3  15603246  Female   27            57000          0
4  15804002    Male   19            76000          0

In [4]:
dataset.drop("User ID", axis=1, inplace=True)

In [5]:
X = dataset.iloc[:,:-1]
X.head()

   Gender  Age  EstimatedSalary
0    Male   19            19000
1    Male   35            20000
2  Female   26            43000
3  Female   27            57000
4    Male   19            76000

In [6]:
Y = dataset.iloc[:,3]
Y.head()

0    0
1    0
2    0
3    0
4    0
Name: Purchased, dtype: int64

In [7]:
sex = pd.get_dummies(X["Gender"],drop_first=True)
sex.head()

   Male
0     1
1     1
2     0
3     0
4     1

In [8]:
X = pd.concat([X,sex],axis=1)

In [9]:
X.head()

   Gender  Age  EstimatedSalary  Male
0    Male   19            19000     1
1    Male   35            20000     1
2  Female   26            43000     0
3  Female   27            57000     0
4    Male   19            76000     1

In [10]:
X.drop("Gender", axis=1, inplace=True)

In [12]:
X.head()

   Age  EstimatedSalary  Male
0   19            19000     1
1   35            20000     1
2   26            43000     0
3   27            57000     0
4   19            76000     1

In [14]:
from sklearn.preprocessing import StandardScaler
sc_x = StandardScaler()
X = sc_x.fit_transform(X)

In [16]:
from sklearn.cross_validation import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X,Y,test_size=1/3,random_state=42)

In [19]:
from sklearn.neighbors import KNeighborsClassifier
classifier = KNeighborsClassifier(n_neighbors=5,metric="minkowski",p=2)
classifier.fit(X_train,y_train)

KNeighborsClassifier(algorithm='auto', leaf_size=30, metric='minkowski',
           metric_params=None, n_jobs=1, n_neighbors=5, p=2,
           weights='uniform')

In [20]:
predictions = classifier.predict(X_test)

In [21]:
from sklearn.metrics import accuracy_score
accuracy_score(predictions, y_test)

0.9253731343283582

In [22]:
from sklearn.metrics import classification_report
classification_report(predictions,y_test)

'             precision    recall  f1-score   support\n\n          0       0.94      0.94      0.94        81\n          1       0.91      0.91      0.91        53\n\navg / total       0.93      0.93      0.93       134\n'

In [23]:
from sklearn.metrics import confusion_matrix
confusion_matrix(predictions, y_test)

array([[76,  5],
       [ 5, 48]])